{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ebddf645",
   "metadata": {},
   "source": [
    "## Загрузка и подготовка данных"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fdcf133d",
   "metadata": {},
   "source": [
    "Загрузка данных из `zip` архива."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3c4313d5",
   "metadata": {
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "from zipfile import ZipFile\n",
    "import json\n",
    "\n",
    "myzip = ZipFile('hr.zip', 'r')\n",
    "names_list = myzip.namelist()\n",
    "\n",
    "names_list"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c0354c01",
   "metadata": {},
   "source": [
    "Функция для выгрузке данных из `json-ld` файлов."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d3bc511a",
   "metadata": {
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "def extract_json(file):\n",
    "    raw_data = myzip.open(file)\n",
    "    return json.load(raw_data)\n",
    "    \n",
    "extract_json('vc_body_urn_uuid_7e8f96fc-3617-45e5-92a6-a7711c5a7225.jsonld')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e6a74e6",
   "metadata": {},
   "source": [
    "Функция для поиска ссылок в данном документе."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "84e01bea",
   "metadata": {
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "def find_links(json_file):\n",
    "    subject = json_file['credentialSubject']\n",
    "    ids = []\n",
    "    for sub_key in subject.keys():\n",
    "        if type(subject[sub_key]) == str and (subject[sub_key][:8] == 'urn:uuid' or subject[sub_key][:8] == 'url:uuid'):\n",
    "            curr_id = subject[sub_key]\n",
    "            ids.append(curr_id)\n",
    "        elif type(subject[sub_key]) == str:\n",
    "            curr_id = subject[sub_key]\n",
    "            props.append(curr_id)\n",
    "    return ids\n",
    "\n",
    "find_links(extract_json('vc_body_urn_uuid_7e8f96fc-3617-45e5-92a6-a7711c5a7225.jsonld'))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e416b987",
   "metadata": {},
   "source": [
    "Функция для поиска полей данных в данном документе."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "76355ec1",
   "metadata": {
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "def find_properties(json_file):\n",
    "    subject = json_file['credentialSubject']\n",
    "    props = {}\n",
    "    for sub_key, sub_value in subject.items():\n",
    "        if type(sub_value) == str and (sub_value[:8] != 'urn:uuid' and sub_value[:8] != 'url:uuid'):\n",
    "            props[sub_key] = sub_value\n",
    "    return props\n",
    "\n",
    "find_properties(extract_json('vc_body_urn_uuid_7e8f96fc-3617-45e5-92a6-a7711c5a7225.jsonld'))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f7d9d1a3",
   "metadata": {},
   "source": [
    "## Загрузка данных в БД"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 384,
   "id": "65c6f5e9",
   "metadata": {},
   "outputs": [],
   "source": [
    "from gremlin_python import statics\n",
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python.process.traversal import T\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "from gremlin_python.process.strategies import *\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "\n",
    "graph = Graph()\n",
    "\n",
    "remoteConn = DriverRemoteConnection('wss://neptunecdkcluster6a0221d7-tf6zid0yicr7.cluster-cnhnmqpcjens.eu-west-1.neptune.amazonaws.com:8182/gremlin','g')\n",
    "g = graph.traversal().withRemote(remoteConn)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c03125a5",
   "metadata": {},
   "source": [
    "Добавляем все документы как вершины с соответствующими полями данных."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 390,
   "id": "bed4dee9",
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_vertex(item):\n",
    "    if item[0] != 'v' or item[1] != 'c':\n",
    "        return\n",
    "    info = extract_json(item)\n",
    "    props_map = find_properties(info)\n",
    "    props = list(props_map.items())\n",
    "    print(info['credentialSubject']['type'])\n",
    "    g.addV('tulchin-vc').property('id', info['id']).next()\n",
    "    j = 0\n",
    "    for key, value in props:\n",
    "        print(j)\n",
    "        j += 1\n",
    "        g.V().has('id', info['id']).hasLabel('tulchin-vc').property(key, value).next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 391,
   "id": "18dd8f3b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CompanyAddendum\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "CandidateAgreement\n",
      "0\n",
      "1\n",
      "2\n",
      "CandidateAgreement\n",
      "0\n",
      "1\n",
      "2\n",
      "UtilityBill\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "KvkExtract\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "ResignationConfirmation\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "EmploymentAgreement\n",
      "0\n",
      "1\n",
      "EmploymentAgreement\n",
      "0\n",
      "1\n",
      "ResignationNotice\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "CompanyAddendum\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "CompanyAddendum\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "Passport\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "CompanyAddendum\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "Passport\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "Passport\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "EmploymentAgreement\n",
      "0\n",
      "1\n",
      "ResignationConfirmation\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "UtilityBill\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "UtilityBill\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "ResignationNotice\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "CandidateAgreement\n",
      "0\n",
      "1\n",
      "2\n",
      "UtilityBill\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "Passport\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "CandidateAgreement\n",
      "0\n",
      "1\n",
      "2\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "UtilityBill\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "Passport\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "Payslip\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "EmploymentAgreement\n",
      "0\n",
      "1\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "Passport\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "UtilityBill\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "EmploymentAgreement\n",
      "0\n",
      "1\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "CandidateAgreement\n",
      "0\n",
      "1\n",
      "2\n",
      "Passport\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "EmploymentAgreement\n",
      "0\n",
      "1\n",
      "CandidateAgreement\n",
      "0\n",
      "1\n",
      "2\n",
      "EmploymentAddendum\n",
      "0\n",
      "1\n",
      "CompanyAddendum\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "CompanyAddendum\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "CompanyAddendum\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "UtilityBill\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "EmploymentAddendum\n",
      "0\n",
      "1\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "EmploymentAddendum\n",
      "0\n",
      "1\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "UtilityBill\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "EmploymentAgreement\n",
      "0\n",
      "1\n",
      "CandidateAgreement\n",
      "0\n",
      "1\n",
      "2\n",
      "Passport\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "UtilityBill\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "CandidateAgreement\n",
      "0\n",
      "1\n",
      "2\n",
      "ResignationNotice\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "ResignationConfirmation\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "EmploymentAgreement\n",
      "0\n",
      "1\n",
      "Passport\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "CandidateAgreement\n",
      "0\n",
      "1\n",
      "2\n",
      "Passport\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "UtilityBill\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "JobOffer\n",
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "for item in names_list:\n",
    "    add_vertex(item)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "957f3bab",
   "metadata": {},
   "source": [
    "Проведем ребра в нашем графе:\n",
    "\n",
    "_Строго говоря никто не обещает нам, что вершина в которую мы проводим ребро существует. Для того чтобы отслеживать подобные ситуации желательно поддерживать hashmap адресов всех `VC`, которые были найдены нами в файлах и добавить туда `VC`, упомянутые в связях(хотя, конечно, это совершенно наивное решение и лучше бы такое вообще запрещать)_"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 392,
   "id": "7a12f7f9",
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_edges(item):\n",
    "    if item[0] != 'v' or item[1] != 'c':\n",
    "        return\n",
    "    info = extract_json(item)\n",
    "    edges_ends = find_links(info)\n",
    "    current_vertex = g.V().has('id', info['id']).hasLabel('tulchin-vc').toList()[0]\n",
    "    c = 0\n",
    "    for neig_end in edges_ends:\n",
    "        print(c)\n",
    "        c += 1\n",
    "        neig_vertex = g.V().has('id', neig_end).hasLabel('tulchin-vc').toList()[0]\n",
    "        g.V(current_vertex).addE('tulchin-link').to(neig_vertex).next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 393,
   "id": "19a1df8e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n",
      "0\n",
      "1\n",
      "2\n",
      "0\n",
      "1\n",
      "2\n",
      "0\n",
      "1\n",
      "0\n",
      "0\n",
      "0\n",
      "0\n",
      "0\n",
      "0\n",
      "1\n",
      "0\n",
      "0\n",
      "0\n",
      "0\n",
      "0\n",
      "0\n",
      "1\n",
      "0\n",
      "1\n",
      "2\n",
      "0\n",
      "1\n",
      "0\n",
      "1\n",
      "2\n",
      "0\n",
      "1\n",
      "0\n",
      "0\n",
      "1\n",
      "0\n",
      "0\n",
      "1\n",
      "0\n",
      "1\n",
      "2\n",
      "0\n",
      "0\n",
      "1\n",
      "2\n",
      "0\n",
      "0\n",
      "1\n",
      "0\n",
      "0\n",
      "1\n",
      "0\n",
      "0\n",
      "1\n",
      "0\n",
      "0\n",
      "1\n",
      "0\n",
      "1\n",
      "0\n",
      "0\n",
      "1\n",
      "2\n",
      "0\n",
      "1\n",
      "2\n",
      "0\n",
      "0\n",
      "1\n",
      "0\n",
      "0\n",
      "0\n",
      "1\n",
      "2\n",
      "0\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "for item in names_list:\n",
    "    add_edges(item)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5f80727a",
   "metadata": {},
   "source": [
    "## Визуализация данных"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 394,
   "id": "05717401",
   "metadata": {},
   "outputs": [],
   "source": [
    "visual = '{\"tulchin-vc\":\"type\"}'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ffd59284",
   "metadata": {
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "%%gremlin -d $visual\n",
    "\n",
    "g.V().hasLabel('tulchin-vc').outE().path().by(elementMap())"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "39af6823",
   "metadata": {},
   "source": [
    "## Оптимальный подход к получению списка сотрудников"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a100ff64",
   "metadata": {
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V().hasLabel('tulchin-vc').has('type', 'EmploymentAgreement').as(\"Agreements\")\n",
    "    .out().has('type', 'CandidateAgreement')\n",
    "    .out().has('type', 'Passport').as(\"Surname\").as('id').select(\"Agreements\").out()\n",
    "    .until(__.not(in().in().count().is(0)))\n",
    "    .repeat(in())\n",
    "    .where(__.not(has('type', 'ResignationNotice').or().has('type', 'ResignationConfirmation')))\n",
    "    .where(__.in().count().is(gt(0)))\n",
    "    .coalesce(\n",
    "        has('type', 'CandidateAgreement').out().has('type', 'JobOffer').values('OfferedPosition').limit(1),\n",
    "        has('type', 'EmploymentAgreement').in().order().by('From', desc).values('Position').limit(1),\n",
    "        has('type', 'CompanyAddendum').values('Position').limit(1),\n",
    "        has('type', 'EmploymentAddendum').in().order().by('From', desc).values('Position').limit(1)\n",
    "    ).as('Position')\n",
    "    .select('Surname', 'Position', 'id').by('Surname').by().by(T.id).dedup()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "71fda497",
   "metadata": {},
   "source": [
    "##  Добавление новых документов"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 397,
   "id": "4d6f4faa",
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_documents(list_of_documents): \n",
    "    for item in list_of_documents:\n",
    "        add_vertex(item)\n",
    "        add_edges(item)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "565b65bf",
   "metadata": {},
   "source": [
    "## Удаление данных из БД"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a772c0fc",
   "metadata": {
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V().hasLabel('tulchin-vc').drop().iterate()\n",
    "g.E().hasLabel('tulchin-link').drop().iterate()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
